AndrewGBelcher/UWE-CSI-Coursework/MobileEmbeddedDevices/STM32/worksheet10/FirstUIP/dhcpc/uIP_Task.c
/*
   A simple Uip task by Craig 02/03/16
 */

/* Standard includes. */
#include <string.h>
#include <stdio.h>



/* Demo includes. */
#include "emac.h"
//#include "partest.h"

/* uip includes. */
#include "uip.h"
#include "uip_arp.h"
#include "timer.h"
#include "clock-arch.h"
#include "dhcpc.h"

/* olimex code includes */
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "misc.h"  /* change from stm32f10x_nvic.h by Craig */
#include "stm32f10x_tim.h"

/*-----------------------------------------------------------*/

/* How long to wait before attempting to connect the MAC again. */
#define uipINIT_WAIT				( 100 / portTICK_RATE_MS )

/* Shortcut to the header within the Rx buffer. */
#define xHeader ((struct uip_eth_hdr *) &uip_buf[ 0 ])

/* Standard constant. */
#define uipTOTAL_FRAME_HEADER_SIZE	54

/*-----------------------------------------------------------*/

/*
 * Setup the MAC address in the MAC itself, and in the uIP stack.
 */
static void prvSetMACAddress( void );

/*
 * Port functions required by the uIP stack.
 */
void clock_init( void );
clock_time_t clock_time( void );

/*-----------------------------------------------------------*/

/* The buffer used by the uIP stack.  In this case the pointer is used to
point to one of the Rx buffers. */
unsigned char *uip_buf = NULL;

/*-----------------------------------------------------------*/

void clock_init(void)
{
	/* This is done when the scheduler starts. */
}
/*-----------------------------------------------------------*/

clock_time_t clock_time( void )
{
	/* no time info needed for our simple app */
}
/*-----------------------------------------------------------*/

void vuIP_Task( )
{
	portBASE_TYPE i;
	uip_ipaddr_t xIPAddr;
	struct timer periodic_timer, arp_timer;
	int iloop;


	/* Initialise the uIP stack. */
	timer_set( &periodic_timer, configTICK_RATE_HZ / 2 );
	timer_set( &arp_timer, configTICK_RATE_HZ * 10 );
	uip_init();
	uip_ipaddr( xIPAddr, configIP_ADDR0, configIP_ADDR1, configIP_ADDR2, configIP_ADDR3 );
	uip_sethostaddr( xIPAddr );
	uip_ipaddr( xIPAddr, configNET_MASK0, configNET_MASK1, configNET_MASK2, configNET_MASK3 );
	uip_setnetmask( xIPAddr );
	//hello_world_init();
	
	uint8_t mac[6] = {0xa8,0x8e,0x24,0xaa,0xbb,0xcc};
	dhcpc_init(&mac,6);

	// Initialise the MAC. 
	while( xEthInitialise() != pdPASS )
	{
		//dealy if the ethernet didn't configure first time
		for (iloop =0; iloop != 999; iloop++)
			;
	}

	prvSetMACAddress();

	printf("HTTP server listening on %d.%d.%d.%d\n\r",
			configIP_ADDR0,
			configIP_ADDR1,
			configIP_ADDR2,
			configIP_ADDR3);

	for( ;; )
	{
		// Is there received data ready to be processed? 
		uip_len = usGetMACRxData();
		if( ( uip_len > 0 ) && ( uip_buf != NULL ) )
		{
			// Standard uIP loop taken from the uIP manual. 
			if( xHeader->type == htons( UIP_ETHTYPE_IP ) )
			{
				uip_arp_ipin();
				uip_input();

				// If the above function invocation resulted in data that
				//should be sent out on the network, the global variable
				//uip_len is set to a value > 0.
				if( uip_len > 0 )
				{
					uip_arp_out();
					vSendMACData( uip_len );
				}
			}
			else if( xHeader->type == htons( UIP_ETHTYPE_ARP ) )
			{
				uip_arp_arpin();

				// If the above function invocation resulted in data that
				//should be sent out on the network, the global variable
				//uip_len is set to a value > 0. 
				if( uip_len > 0 )
				{
					vSendMACData( uip_len );
				}
			}
		}
		else
		{
			if( ( timer_expired( &periodic_timer ) ) && ( uip_buf != NULL ) )
			{
				timer_reset( &periodic_timer );
				for( i = 0; i < UIP_CONNS; i++ )
				{
					uip_periodic( i );

					// If the above function invocation resulted in data that
					//should be sent out on the network, the global variable
				//	uip_len is set to a value > 0. 
					if( uip_len > 0 )
					{
						uip_arp_out();
						vSendMACData( uip_len );
					}
				}

				// Call the ARP timer function every 10 seconds. 
				if( timer_expired( &arp_timer ) )
				{
					timer_reset( &arp_timer );
					uip_arp_timer();
				}
			}
			
		}
	}
}
/*-----------------------------------------------------------*/

static void prvSetMACAddress( void )
{
	struct uip_eth_addr xAddr;

	/* Configure the MAC address in the uIP stack. */
	xAddr.addr[ 0 ] = configMAC_ADDR0;
	xAddr.addr[ 1 ] = configMAC_ADDR1;
	xAddr.addr[ 2 ] = configMAC_ADDR2;
	xAddr.addr[ 3 ] = configMAC_ADDR3;
	xAddr.addr[ 4 ] = configMAC_ADDR4;
	xAddr.addr[ 5 ] = configMAC_ADDR5;
	uip_setethaddr( xAddr );
}
/*-----------------------------------------------------------*/



